In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

from scipy.stats import norm

%matplotlib inline

pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',50)

In [2]:
df = pd.read_csv("heights.csv")

In [3]:
df

         sex     height
0       Male  75.000000
1       Male  70.000000
2       Male  68.000000
3       Male  74.000000
4       Male  61.000000
...      ...        ...
1045  Female  69.000000
1046    Male  69.000000
1047    Male  63.385827
1048    Male  66.000000
1049    Male  66.000000

[1050 rows x 2 columns]

In [4]:
#What are the two variable names used in the heights dataset?
df.columns

Index(['sex', 'height'], dtype='object')

In [5]:
#What data type is the sex variable?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     1050 non-null   object
 1   height  1050 non-null   float64
dtypes: float64(1), object(1)
memory usage: 16.5+ KB

In [6]:
#Use the unique and length functions to determine how many unique heights were reported.
df['height'].unique()

array([75.        , 70.        , 68.        , 74.        , 61.        ,
       65.        , 66.        , 62.        , 67.        , 72.        ,
       69.        , 64.        , 60.        , 73.        , 71.        ,
       66.75      , 63.        , 70.5       , 64.96062992, 64.1732    ,
       68.5       , 78.74015748, 69.6       , 66.5       , 71.5       ,
       76.        , 74.5       , 78.        , 62.5       , 77.        ,
       68.89      , 64.173     , 59.        , 67.7       , 71.7       ,
       70.87      , 68.11      , 64.57      , 51.        , 59.05511811,
       80.        , 64.96      , 68.8976378 , 69.68503937, 72.05      ,
       72.5       , 70.07874016, 53.        , 64.17322835, 59.0551    ,
       66.92      , 70.86614173, 74.8       , 68.4       , 69.3       ,
       66.53543307, 68.8976    , 61.81102362, 72.04724409, 67.72      ,
       72.4       , 79.05      , 63.77952756, 66.4       , 69.29      ,
       66.92913386, 66.1416    , 74.80314961, 72.44094488, 53.77      ,
       65.7480315 , 67.7165    , 54.        , 68.1102    , 64.961     ,
       67.71653543, 66.14173228, 70.8       , 77.1654    , 69.29133858,
       67.5       , 72.83      , 66.7       , 68.11023622, 68.50393701,
       67.78      , 67.71      , 79.        , 68.8       , 70.1       ,
       73.2       , 73.62      , 68.9       , 66.9       , 66.9291    ,
       70.85      , 72.44      , 61.32      , 66.93      , 58.        ,
       55.        , 73.22      , 66.1417    , 62.99212598, 70.08      ,
       67.2       , 72.45      , 75.98      , 75.59055118, 70.866     ,
       62.4       , 75.6       , 71.65      , 62.6       , 67.3       ,
       64.2       , 66.14      , 64.5       , 70.8661    , 75.4       ,
       72.8346    , 71.65354331, 64.56692913, 72.83464567, 78.74      ,
       64.9       , 59.84251969, 70.86      , 62.20472441, 68.11024   ,
       70.47244094, 52.        , 81.        , 68.8976378 , 62.5984252 ,
       82.67716535, 50.        , 73.22834646, 63.38582677])

In [7]:
df['height'].nunique()

139

In [8]:
#What proportion of the data is between 69 and 72 inches (taller than 69 but shorter or equal to 72)? A proportion is between 0 and 1.
df.describe()

            height
count  1050.000000
mean     68.323013
std       4.078617
min      50.000000
25%      66.000000
50%      68.500000
75%      71.000000
max      82.677165

In [9]:
df['height'].std()

4.078616969642444

In [10]:
norm.cdf(df['height'])

array([1., 1., 1., ..., 1., 1., 1.])

In [11]:
# Define a variable male that contains the male heights.
# Define a variable female that contains the female heights.
# Report the length of each variable.

male = df[df['sex'] == 'Male']
female = df[df['sex'] == 'Female']

In [12]:
len(male)

812

In [13]:
len(female)

238

In [14]:
male.describe()

           height
count  812.000000
mean    69.314755
std      3.611024
min     50.000000
25%     67.000000
50%     69.000000
75%     72.000000
max     82.677165

In [15]:
female.describe()

           height
count  238.000000
mean    64.939424
std      3.760656
min     51.000000
25%     63.000000
50%     64.980315
75%     67.000000
max     79.000000

In [17]:
galton = pd.read_csv("galton.csv")

In [18]:
galton

    Family  Father  Mother Gender  Height  Kids
0        1    78.5    67.0      M    73.2     4
1        1    78.5    67.0      F    69.2     4
2        1    78.5    67.0      F    69.0     4
3        1    78.5    67.0      F    69.0     4
4        2    75.5    66.5      M    73.5     4
..     ...     ...     ...    ...     ...   ...
893   136A    68.5    65.0      M    68.5     8
894   136A    68.5    65.0      M    67.7     8
895   136A    68.5    65.0      F    64.0     8
896   136A    68.5    65.0      F    63.5     8
897   136A    68.5    65.0      F    63.0     8

[898 rows x 6 columns]

In [19]:
galton.describe()

           Father      Mother      Height        Kids
count  898.000000  898.000000  898.000000  898.000000
mean    69.232851   64.084410   66.760690    6.135857
std      2.470256    2.307025    3.582918    2.685156
min     62.000000   58.000000   56.000000    1.000000
25%     68.000000   63.000000   64.000000    4.000000
50%     69.000000   64.000000   66.500000    6.000000
75%     71.000000   65.500000   69.700000    8.000000
max     78.500000   70.500000   79.000000   15.000000